routes/web.php

select * from `users`
---
});

Auth::routes();
Route::get('/users', 'Profiles\UsersController@index')->name('users');