app/Http/Controllers/Profiles/ProfilesController.php

    public function index(Request $request) {

        if ($request->has('name') && !empty($request->input('name'))){

            $request->validate(['name' => 'regex:/^[\pL\s]+$/u',],
            				   ['name.regex' => 'Only letters and spaces.',]);

            $users = User::where ('name', 'like' , '%' . $request->input('name') . '%')->get();
        }

        else{
            $users = User::all();
---
select * from `users`
select * from `users` where `name` like '%Ivo%'