app/Http/Controllers/Profiles/UsersController.php

select * from `users` where `admin` = '0' and `blocked` = '0'
select * from `users` where `name` like '%Melo%' and `admin` = '1' and `blocked` = '1'
select * from `users`
---
    public function index(Request $request) {
        if ($request->has('name')){

            $admin = $request->has('admin');
            $blocked = $request->has('blocked');

            if (empty($request->input('name')))
                $users = DB::table('users')->where('admin', $admin)
                                           ->where('blocked', $blocked)
                                           ->get();

            else
                $user = $request->validate([
                                'name' => 'regex:/^[\pL\s]+$/u',
                                ], [ // Custom Messages
                                'name.regex' => 'Only letters and spaces.',
                                ]);

                $users = DB::table('users')->where ('name', 'like' , '%' . $user->name . '%')
                                           ->where('admin', $admin)
                                           ->where('blocked', $blocked)
                                           ->get();
        }

        else{
            $users = DB::table('users')->get();