app/Http/Controllers/ProfilesController.php

    public function index() {
    	$users = DB::table('users')->get();
---
select * from `users`