app/Http/Controllers/UsersController.php

select * from `users` where `admin` = '1' and `blocked` = '1'
select * from `users` where `name` = 'abc' and `admin` = '0' and `blocked` = '1'
select * from `users`
---
    public function index(Request $request) {
        if ($request->has('name')){

            $admin = $request->has('admin');
            $blocked = $request->has('blocked');

            if (empty($request->input('name')))
                $users = DB::table('users')->where('admin', $admin)
                                           ->where('blocked', $blocked)
                                           ->get();

            else
                $users = DB::table('users')->where ('name', 'like' , '%' . $request->input('name') . '%')
                                           ->where('admin', $admin)
                                           ->where('blocked', $blocked)
                                           ->get();
        }

        else{
            $users = DB::table('users')->get();

update `users` set `blocked` = '1' where `id` = '17'
---
    public function block($id) {
        DB::table('users')
            ->where('id', $id)
            ->update(['blocked' => 1]);

update `users` set `blocked` = '0' where `id` = '2'
---
    public function unblock($id) {
        DB::table('users')
            ->where('id', $id)
            ->update(['blocked' => 0]);

update `users` set `admin` = '1' where `id` = '12'
---
    public function promote($id) {
        DB::table('users')
            ->where('id', $id)
            ->update(['admin' => 1]);

update `users` set `admin` = '0' where `id` = '4'
---
    public function demote($id) {
          DB::table('users')
            ->where('id', $id)
            ->update(['admin' => 0]);