app/Http/Controllers/UsersController.php

select * from `users`
---
    public function index() {

        $users = DB::table('users')->get();